---
type: IPipeFittingAndAccessoryPressureDropServer
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 3
tags: [revit-api, class]
---

# IPipeFittingAndAccessoryPressureDropServer

`Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServer` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Calculate | 2014 | `bool Calculate ( PipeFittingAndAccessoryPressureDropData data )` |
| Method | GetDataSchema | 2014 | `Schema GetDataSchema ()` |
| Method | IsApplicable | 2014 | `bool IsApplicable ( PipeFittingAndAccessoryPressureDropData data )` |